//! ما هو التخطيط؟
// التخطيط هو تحديد هف ثم تحديد الخطوات اللازمة لتحقيقها وتحديد الوقت اللازم لتحقيقها والموارد المطلوبة لتحقيقها.

//! ما هي أهمية التخطيط؟
// 1- تحويل الحلم الي هدف واقعي.
// 2- وضوح الرؤيه.
// 3- زياده الثقه و تقليل الضغط

//! التخطيط عشان يكون فعال لازم تتوفر فيه مجموعه من الصفات
// 1- اهدافه تكون واضحه ومحدده وقابله للقياس.
// 2- عمليه مستمره ومرنه حتي بعد البدأ في التنفيذ
// 3- التخطيط الفعال واقعي ومنطقي ومبني علي الواقع والمعلومات المتاحه
// 4- التخطيط الفعال بسيط

//! "Plans are useless, but planning is everything" - Dwight D. Eisenhower

//! -------------------------------------------------------------------------------------------------------//
//!  The one thing (BOOK)
//! مهاره وضع الاهداف الفعاله لها تلت مكونات اساسيه
// 1- تحديد الاهداف
// 2- فلتره الاهداف
// 3- تقسيم الاهداف الكبيره لاهداف اصغر

//! أولا تحديد الاهداف
// SMART Goals
// S: Specific => محدد
// M: Measurable => قابل للقياس
// A: Attainable => ممكن تحقيقه
// R: Realistic => واقعي
// T: Time-bound => محدد بزمن

//! ثانيا فلتره الاهداف
// جيب ورقه وقلم واقسمها نصفين النصف الاول من اكتب كل الاهداف اللي عاوز تحففها
// بعد كدا جاوب علي سؤال ولو في هدق واحد يمكن تحقيقه اي هو واكتبه في النصف التاني
// واشطبه من النصف الاول وهكذا لحد ما توصل لعدد الاهداف التي يمكن تحقيقها مها

//! ثالثا تقسيم الاهداف الكبيره لاهداف اصغر
// تقسيم الاهداف بعيده المدي الي اهداف قريبه المدي

//! -------------------------------------------------------------------------------------------------------//
//! القياس والمتابعه
//! "What gets tracked gets measured, and what gets measured gets improved." - Peter Drucker

//! فوائد المتابعه و القياس
// 1- المتابعه تجلب الوعي
// 2- اكتشاف الأخطاء وتلافيها
// 3- قياس التطور ودفعات الحماس
//! -------------------------------------------------------------------------------------------------------//
//! GTD (Getting Things Done) (BOOK)
//! مراحل نظام GTD
// 1- Capture / Collect => جمع المهام (google keep)
// 2- Process => معالجه المهام (مراجعه المهام بشكل دوري)
// 3- Organize => تنظيم المهام (Trello)
// 4- Planning => التخطيط
// 5- Engage => التنفيذ
//! -------------------------------------------------------------------------------------------------------//
//! استخدام تطبيق google keep
//! إضافه ملاحظات بأنواعها المختلفه
//! -------------------------------------------------------------------------------------------------------//
//! استخدام تطبيق Trello
// - مشروع تجاري
// - بناء موقع او تطبيق
// - رحله / سفر / عزومه
// - جدول دراسي
// - قوائم الكتب
// - أهداف في الحياه
//! -------------------------------------------------------------------------------------------------------//
//! دفتر الانجاز
//! ما هو دفتر الانجاز؟ وانجازاتنا بشكل يومي واسبوعي وشهري
// هو كشكول بنتابع فيه خططنا واهدافنا علي مدار فتره طويله عده شهور او سنه

//! ما هي فوائد دفتر الانجاز؟
// 1- الوعي بالوقت
// 2- قياس ومراقبة التقدم في تحقيق الاهداف
// 3- دفعات حماس تساعد علي الاستمرار
// 4- وضوح الرؤيه
// 5- القدره علي تصحيح المسار
// 6- مداومة أكبر على تنفيذ الخطط والأعمال
// 7- زيادة واضحه في معدل الإنتاجيه
